#+TITLE: Adaptive Metropolis in R

* Test Area

#+begin_src R :session example :results output :tangle AM_in_R.Rscript
#main(d=10,n=100000, thinrate=10, burnin=10000)

sigma <- as.matrix(read.csv("./data/chaotic_variance.csv", header = FALSE))
compute_time_graph(sigma, 30)
#+end_src

#+RESULTS:
: [1] "The true variance of x_1 is 8.22879600628684"
: [1] "The empirical sigma value is 8.20496592343448"
: [1] "The b value is 1.00002817996086"
: [1] "The computation took 66.1090097427368 seconds"
